stress-test/pilot-bypass-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: stress-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 100 looping VUs for 2m0s (gracefulStop: 30s)

time="2026-01-16T13:31:27-05:00" level=info msg="🔐 Configurando prueba de estrés con bypass de autenticación..." source=console
time="2026-01-16T13:31:27-05:00" level=info msg="✅ Bypass configurado exitosamente" source=console

running (0m01.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 100 VUs  0m01.0s/2m0s

running (0m02.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 100 VUs  0m02.0s/2m0s

running (0m03.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 100 VUs  0m03.0s/2m0s

running (0m04.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 100 VUs  0m04.0s/2m0s

running (0m05.0s), 100/100 VUs, 2 complete and 0 interrupted iterations
default   [   4% ] 100 VUs  0m05.0s/2m0s
time="2026-01-16T13:31:32-05:00" level=warning msg="Request Failed" error="Post \"https://pianoemotion.com/api/trpc/appointments.list\": EOF"
time="2026-01-16T13:31:32-05:00" level=warning msg="Request Failed" error="Post \"https://pianoemotion.com/api/trpc/auth.me\": EOF"
time="2026-01-16T13:31:32-05:00" level=warning msg="Request Failed" error="Post \"https://pianoemotion.com/api/trpc/auth.me\": EOF"
time="2026-01-16T13:31:32-05:00" level=warning msg="Request Failed" error="Post \"https://pianoemotion.com/api/trpc/auth.me\": EOF"
time="2026-01-16T13:31:32-05:00" level=warning msg="Request Failed" error="Post \"https://pianoemotion.com/api/trpc/clients.list\": EOF"
time="2026-01-16T13:31:32-05:00" level=warning msg="Request Failed" error="Post \"https://pianoemotion.com/api/trpc/services.list\": EOF"
time="2026-01-16T13:31:32-05:00" level=warning msg="Request Failed" error="Post \"https://pianoemotion.com/api/trpc/appointments.list\": EOF"
time="2026-01-16T13:31:32-05:00" level=warning msg="Request Failed" error="Post \"https://pianoemotion.com/api/trpc/services.list\": EOF"
time="2026-01-16T13:31:32-05:00" level=warning msg="Request Failed" error="Post \"https://pianoemotion.com/api/trpc/services.list\": EOF"
time="2026-01-16T13:31:32-05:00" level=warning msg="Request Failed" error="Post \"https://pianoemotion.com/api/trpc/auth.me\": EOF"
time="2026-01-16T13:31:32-05:00" level=warning msg="Request Failed" error="Post \"https://pianoemotion.com/api/trpc/clients.list\": EOF"
time="2026-01-16T13:31:32-05:00" level=warning msg="Request Failed" error="Post \"https://pianoemotion.com/api/trpc/auth.me\": EOF"
time="2026-01-16T13:31:32-05:00" level=warning msg="Request Failed" error="Post \"https://pianoemotion.com/api/trpc/clients.list\": EOF"
time="2026-01-16T13:31:32-05:00" level=warning msg="Request Failed" error="Post \"https://pianoemotion.com/api/trpc/services.list\": EOF"
time="2026-01-16T13:31:32-05:00" level=warning msg="Request Failed" error="Post \"https://pianoemotion.com/api/trpc/pianos.list\": EOF"
time="2026-01-16T13:31:32-05:00" level=warning msg="Request Failed" error="Post \"https://pianoemotion.com/api/trpc/pianos.list\": EOF"
time="2026-01-16T13:31:32-05:00" level=warning msg="Request Failed" error="Post \"https://pianoemotion.com/api/trpc/appointments.list\": EOF"

running (0m06.0s), 100/100 VUs, 6 complete and 0 interrupted iterations
default   [   5% ] 100 VUs  0m06.0s/2m0s

running (0m07.0s), 100/100 VUs, 12 complete and 0 interrupted iterations
default   [   6% ] 100 VUs  0m07.0s/2m0s

running (0m08.0s), 100/100 VUs, 23 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  0m08.0s/2m0s

running (0m09.0s), 100/100 VUs, 31 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  0m09.0s/2m0s

running (0m10.0s), 100/100 VUs, 61 complete and 0 interrupted iterations
default   [   8% ] 100 VUs  0m10.0s/2m0s

running (0m11.0s), 100/100 VUs, 88 complete and 0 interrupted iterations
default   [   9% ] 100 VUs  0m11.0s/2m0s

running (0m12.0s), 100/100 VUs, 116 complete and 0 interrupted iterations
default   [  10% ] 100 VUs  0m12.0s/2m0s

running (0m13.0s), 100/100 VUs, 121 complete and 0 interrupted iterations
default   [  11% ] 100 VUs  0m13.0s/2m0s

running (0m14.0s), 100/100 VUs, 121 complete and 0 interrupted iterations
default   [  12% ] 100 VUs  0m14.0s/2m0s

running (0m15.0s), 100/100 VUs, 121 complete and 0 interrupted iterations
default   [  12% ] 100 VUs  0m15.0s/2m0s

running (0m16.0s), 100/100 VUs, 123 complete and 0 interrupted iterations
default   [  13% ] 100 VUs  0m16.0s/2m0s

running (0m17.0s), 100/100 VUs, 130 complete and 0 interrupted iterations
default   [  14% ] 100 VUs  0m17.0s/2m0s

running (0m18.0s), 100/100 VUs, 144 complete and 0 interrupted iterations
default   [  15% ] 100 VUs  0m18.0s/2m0s

running (0m19.0s), 100/100 VUs, 170 complete and 0 interrupted iterations
default   [  16% ] 100 VUs  0m19.0s/2m0s

running (0m20.0s), 100/100 VUs, 198 complete and 0 interrupted iterations
default   [  17% ] 100 VUs  0m20.0s/2m0s

running (0m21.0s), 100/100 VUs, 226 complete and 0 interrupted iterations
default   [  17% ] 100 VUs  0m21.0s/2m0s

running (0m22.0s), 100/100 VUs, 250 complete and 0 interrupted iterations
default   [  18% ] 100 VUs  0m22.0s/2m0s

running (0m23.0s), 100/100 VUs, 271 complete and 0 interrupted iterations
default   [  19% ] 100 VUs  0m23.0s/2m0s

running (0m24.0s), 100/100 VUs, 293 complete and 0 interrupted iterations
default   [  20% ] 100 VUs  0m24.0s/2m0s

running (0m25.0s), 100/100 VUs, 323 complete and 0 interrupted iterations
default   [  21% ] 100 VUs  0m25.0s/2m0s

running (0m26.0s), 100/100 VUs, 344 complete and 0 interrupted iterations
default   [  22% ] 100 VUs  0m26.0s/2m0s

running (0m27.0s), 100/100 VUs, 372 complete and 0 interrupted iterations
default   [  22% ] 100 VUs  0m27.0s/2m0s

running (0m28.0s), 100/100 VUs, 397 complete and 0 interrupted iterations
default   [  23% ] 100 VUs  0m28.0s/2m0s

running (0m29.0s), 100/100 VUs, 424 complete and 0 interrupted iterations
default   [  24% ] 100 VUs  0m29.0s/2m0s

running (0m30.0s), 100/100 VUs, 442 complete and 0 interrupted iterations
default   [  25% ] 100 VUs  0m30.0s/2m0s

running (0m31.0s), 100/100 VUs, 464 complete and 0 interrupted iterations
default   [  26% ] 100 VUs  0m31.0s/2m0s

running (0m32.0s), 100/100 VUs, 504 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  0m32.0s/2m0s

running (0m33.0s), 100/100 VUs, 530 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  0m33.0s/2m0s

running (0m34.0s), 100/100 VUs, 555 complete and 0 interrupted iterations
default   [  28% ] 100 VUs  0m34.0s/2m0s

running (0m35.0s), 100/100 VUs, 576 complete and 0 interrupted iterations
default   [  29% ] 100 VUs  0m35.0s/2m0s

running (0m36.0s), 100/100 VUs, 604 complete and 0 interrupted iterations
default   [  30% ] 100 VUs  0m36.0s/2m0s

running (0m37.0s), 100/100 VUs, 631 complete and 0 interrupted iterations
default   [  31% ] 100 VUs  0m37.0s/2m0s

running (0m38.0s), 100/100 VUs, 660 complete and 0 interrupted iterations
default   [  32% ] 100 VUs  0m38.0s/2m0s

running (0m39.0s), 100/100 VUs, 689 complete and 0 interrupted iterations
default   [  32% ] 100 VUs  0m39.0s/2m0s

running (0m40.0s), 100/100 VUs, 705 complete and 0 interrupted iterations
default   [  33% ] 100 VUs  0m40.0s/2m0s

running (0m41.0s), 100/100 VUs, 736 complete and 0 interrupted iterations
default   [  34% ] 100 VUs  0m41.0s/2m0s

running (0m42.0s), 100/100 VUs, 765 complete and 0 interrupted iterations
default   [  35% ] 100 VUs  0m42.0s/2m0s

running (0m43.0s), 100/100 VUs, 787 complete and 0 interrupted iterations
default   [  36% ] 100 VUs  0m43.0s/2m0s

running (0m44.0s), 100/100 VUs, 818 complete and 0 interrupted iterations
default   [  37% ] 100 VUs  0m44.0s/2m0s

running (0m45.0s), 100/100 VUs, 844 complete and 0 interrupted iterations
default   [  37% ] 100 VUs  0m45.0s/2m0s

running (0m46.0s), 100/100 VUs, 868 complete and 0 interrupted iterations
default   [  38% ] 100 VUs  0m46.0s/2m0s

running (0m47.0s), 100/100 VUs, 893 complete and 0 interrupted iterations
default   [  39% ] 100 VUs  0m47.0s/2m0s

running (0m48.0s), 100/100 VUs, 918 complete and 0 interrupted iterations
default   [  40% ] 100 VUs  0m48.0s/2m0s

running (0m49.0s), 100/100 VUs, 948 complete and 0 interrupted iterations
default   [  41% ] 100 VUs  0m49.0s/2m0s

running (0m50.0s), 100/100 VUs, 967 complete and 0 interrupted iterations
default   [  42% ] 100 VUs  0m50.0s/2m0s

running (0m51.0s), 100/100 VUs, 1004 complete and 0 interrupted iterations
default   [  42% ] 100 VUs  0m51.0s/2m0s

running (0m52.0s), 100/100 VUs, 1026 complete and 0 interrupted iterations
default   [  43% ] 100 VUs  0m52.0s/2m0s

running (0m53.0s), 100/100 VUs, 1059 complete and 0 interrupted iterations
default   [  44% ] 100 VUs  0m53.0s/2m0s

running (0m54.0s), 100/100 VUs, 1079 complete and 0 interrupted iterations
default   [  45% ] 100 VUs  0m54.0s/2m0s

running (0m55.0s), 100/100 VUs, 1105 complete and 0 interrupted iterations
default   [  46% ] 100 VUs  0m55.0s/2m0s

running (0m56.0s), 100/100 VUs, 1132 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  0m56.0s/2m0s

running (0m57.0s), 100/100 VUs, 1157 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  0m57.0s/2m0s

running (0m58.0s), 100/100 VUs, 1189 complete and 0 interrupted iterations
default   [  48% ] 100 VUs  0m58.0s/2m0s

running (0m59.0s), 100/100 VUs, 1214 complete and 0 interrupted iterations
default   [  49% ] 100 VUs  0m59.0s/2m0s

running (1m00.0s), 100/100 VUs, 1241 complete and 0 interrupted iterations
default   [  50% ] 100 VUs  1m00.0s/2m0s

running (1m01.0s), 100/100 VUs, 1270 complete and 0 interrupted iterations
default   [  51% ] 100 VUs  1m01.0s/2m0s

running (1m02.0s), 100/100 VUs, 1297 complete and 0 interrupted iterations
default   [  52% ] 100 VUs  1m02.0s/2m0s

running (1m03.0s), 100/100 VUs, 1320 complete and 0 interrupted iterations
default   [  52% ] 100 VUs  1m03.0s/2m0s

running (1m04.0s), 100/100 VUs, 1347 complete and 0 interrupted iterations
default   [  53% ] 100 VUs  1m04.0s/2m0s

running (1m05.0s), 100/100 VUs, 1378 complete and 0 interrupted iterations
default   [  54% ] 100 VUs  1m05.0s/2m0s

running (1m06.0s), 100/100 VUs, 1405 complete and 0 interrupted iterations
default   [  55% ] 100 VUs  1m06.0s/2m0s

running (1m07.0s), 100/100 VUs, 1430 complete and 0 interrupted iterations
default   [  56% ] 100 VUs  1m07.0s/2m0s

running (1m08.0s), 100/100 VUs, 1453 complete and 0 interrupted iterations
default   [  57% ] 100 VUs  1m08.0s/2m0s

running (1m09.0s), 100/100 VUs, 1481 complete and 0 interrupted iterations
default   [  57% ] 100 VUs  1m09.0s/2m0s

running (1m10.0s), 100/100 VUs, 1513 complete and 0 interrupted iterations
default   [  58% ] 100 VUs  1m10.0s/2m0s

running (1m11.0s), 100/100 VUs, 1538 complete and 0 interrupted iterations
default   [  59% ] 100 VUs  1m11.0s/2m0s

running (1m12.0s), 100/100 VUs, 1565 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  1m12.0s/2m0s

running (1m13.0s), 100/100 VUs, 1590 complete and 0 interrupted iterations
default   [  61% ] 100 VUs  1m13.0s/2m0s

running (1m14.0s), 100/100 VUs, 1622 complete and 0 interrupted iterations
default   [  62% ] 100 VUs  1m14.0s/2m0s

running (1m15.0s), 100/100 VUs, 1650 complete and 0 interrupted iterations
default   [  62% ] 100 VUs  1m15.0s/2m0s

running (1m16.0s), 100/100 VUs, 1673 complete and 0 interrupted iterations
default   [  63% ] 100 VUs  1m16.0s/2m0s

running (1m17.0s), 100/100 VUs, 1697 complete and 0 interrupted iterations
default   [  64% ] 100 VUs  1m17.0s/2m0s

running (1m18.0s), 100/100 VUs, 1725 complete and 0 interrupted iterations
default   [  65% ] 100 VUs  1m18.0s/2m0s

running (1m19.0s), 100/100 VUs, 1754 complete and 0 interrupted iterations
default   [  66% ] 100 VUs  1m19.0s/2m0s

running (1m20.0s), 100/100 VUs, 1782 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  1m20.0s/2m0s

running (1m21.0s), 100/100 VUs, 1802 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  1m21.0s/2m0s

running (1m22.0s), 100/100 VUs, 1825 complete and 0 interrupted iterations
default   [  68% ] 100 VUs  1m22.0s/2m0s

running (1m23.0s), 100/100 VUs, 1852 complete and 0 interrupted iterations
default   [  69% ] 100 VUs  1m23.0s/2m0s

running (1m24.0s), 100/100 VUs, 1881 complete and 0 interrupted iterations
default   [  70% ] 100 VUs  1m24.0s/2m0s

running (1m25.0s), 100/100 VUs, 1906 complete and 0 interrupted iterations
default   [  71% ] 100 VUs  1m25.0s/2m0s

running (1m26.0s), 100/100 VUs, 1931 complete and 0 interrupted iterations
default   [  72% ] 100 VUs  1m26.0s/2m0s

running (1m27.0s), 100/100 VUs, 1962 complete and 0 interrupted iterations
default   [  72% ] 100 VUs  1m27.0s/2m0s

running (1m28.0s), 100/100 VUs, 1989 complete and 0 interrupted iterations
default   [  73% ] 100 VUs  1m28.0s/2m0s

running (1m29.0s), 100/100 VUs, 2014 complete and 0 interrupted iterations
default   [  74% ] 100 VUs  1m29.0s/2m0s

running (1m30.0s), 100/100 VUs, 2032 complete and 0 interrupted iterations
default   [  75% ] 100 VUs  1m30.0s/2m0s

running (1m31.0s), 100/100 VUs, 2065 complete and 0 interrupted iterations
default   [  76% ] 100 VUs  1m31.0s/2m0s

running (1m32.0s), 100/100 VUs, 2090 complete and 0 interrupted iterations
default   [  77% ] 100 VUs  1m32.0s/2m0s

running (1m33.0s), 100/100 VUs, 2113 complete and 0 interrupted iterations
default   [  77% ] 100 VUs  1m33.0s/2m0s

running (1m34.0s), 100/100 VUs, 2145 complete and 0 interrupted iterations
default   [  78% ] 100 VUs  1m34.0s/2m0s

running (1m35.0s), 100/100 VUs, 2167 complete and 0 interrupted iterations
default   [  79% ] 100 VUs  1m35.0s/2m0s

running (1m36.0s), 100/100 VUs, 2190 complete and 0 interrupted iterations
default   [  80% ] 100 VUs  1m36.0s/2m0s

running (1m37.0s), 100/100 VUs, 2226 complete and 0 interrupted iterations
default   [  81% ] 100 VUs  1m37.0s/2m0s

running (1m38.0s), 100/100 VUs, 2246 complete and 0 interrupted iterations
default   [  82% ] 100 VUs  1m38.0s/2m0s

running (1m39.0s), 100/100 VUs, 2269 complete and 0 interrupted iterations
default   [  82% ] 100 VUs  1m39.0s/2m0s

running (1m40.0s), 100/100 VUs, 2301 complete and 0 interrupted iterations
default   [  83% ] 100 VUs  1m40.0s/2m0s

running (1m41.0s), 100/100 VUs, 2330 complete and 0 interrupted iterations
default   [  84% ] 100 VUs  1m41.0s/2m0s

running (1m42.0s), 100/100 VUs, 2355 complete and 0 interrupted iterations
default   [  85% ] 100 VUs  1m42.0s/2m0s

running (1m43.0s), 100/100 VUs, 2382 complete and 0 interrupted iterations
default   [  86% ] 100 VUs  1m43.0s/2m0s

running (1m44.0s), 100/100 VUs, 2408 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  1m44.0s/2m0s

running (1m45.0s), 100/100 VUs, 2430 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  1m45.0s/2m0s

running (1m46.0s), 100/100 VUs, 2462 complete and 0 interrupted iterations
default   [  88% ] 100 VUs  1m46.0s/2m0s

running (1m47.0s), 100/100 VUs, 2485 complete and 0 interrupted iterations
default   [  89% ] 100 VUs  1m47.0s/2m0s

running (1m48.0s), 100/100 VUs, 2509 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  1m48.0s/2m0s

running (1m49.0s), 100/100 VUs, 2544 complete and 0 interrupted iterations
default   [  91% ] 100 VUs  1m49.0s/2m0s

running (1m50.0s), 100/100 VUs, 2564 complete and 0 interrupted iterations
default   [  92% ] 100 VUs  1m50.0s/2m0s

running (1m51.0s), 100/100 VUs, 2591 complete and 0 interrupted iterations
default   [  92% ] 100 VUs  1m51.0s/2m0s

running (1m52.0s), 100/100 VUs, 2620 complete and 0 interrupted iterations
default   [  93% ] 100 VUs  1m52.0s/2m0s

running (1m53.0s), 100/100 VUs, 2646 complete and 0 interrupted iterations
default   [  94% ] 100 VUs  1m53.0s/2m0s

running (1m54.0s), 100/100 VUs, 2675 complete and 0 interrupted iterations
default   [  95% ] 100 VUs  1m54.0s/2m0s

running (1m55.0s), 100/100 VUs, 2699 complete and 0 interrupted iterations
default   [  96% ] 100 VUs  1m55.0s/2m0s

running (1m56.0s), 100/100 VUs, 2716 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  1m56.0s/2m0s

running (1m57.0s), 100/100 VUs, 2747 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  1m57.0s/2m0s

running (1m58.0s), 100/100 VUs, 2777 complete and 0 interrupted iterations
default   [  98% ] 100 VUs  1m58.0s/2m0s

running (1m59.0s), 100/100 VUs, 2802 complete and 0 interrupted iterations
default   [  99% ] 100 VUs  1m59.0s/2m0s

running (2m00.0s), 100/100 VUs, 2830 complete and 0 interrupted iterations
default   [ 100% ] 100 VUs  2m00.0s/2m0s

running (2m01.0s), 078/100 VUs, 2852 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  2m0s

running (2m02.0s), 046/100 VUs, 2884 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  2m0s

running (2m03.0s), 017/100 VUs, 2913 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  2m0s

running (2m04.0s), 006/100 VUs, 2924 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  2m0s


  █ THRESHOLDS 

    errors
    ✗ 'rate<0.01' rate=23.47611/s

    http_req_duration
    ✓ 'p(95)<1000' p(95)=967ms
    ✗ 'p(99)<2000' p(99)=5.74s

    http_req_failed
    ✗ 'rate<0.05' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 7058   56.550985/s
    checks_succeeded...: 47.53% 3355 out of 7058
    checks_failed......: 52.46% 3703 out of 7058

    ✗ clients status is 200
      ↳  0% — ✓ 0 / ✗ 1181
    ✗ response time < 1000ms
      ↳  95% — ✓ 3355 / ✗ 174
    ✗ appointments status is 200
      ↳  0% — ✓ 0 / ✗ 587
    ✗ auth status is 200
      ↳  0% — ✓ 0 / ✗ 599
    ✗ pianos status is 200
      ↳  0% — ✓ 0 / ✗ 593
    ✗ services status is 200
      ↳  0% — ✓ 0 / ✗ 569

    CUSTOM
    errors...............: 2930    23.47611/s

    HTTP
    http_req_duration....: avg=487.65ms min=0s    med=227.46ms max=6.63s  p(90)=350.86ms p(95)=967ms
    http_req_failed......: 100.00% 3529 out of 3529
    http_reqs............: 3529    28.275493/s

    EXECUTION
    iteration_duration...: avg=4.16s    min=2.19s med=3.89s    max=12.23s p(90)=5.19s    p(95)=8.11s
    iterations...........: 2930    23.47611/s
    vus..................: 6       min=6            max=100
    vus_max..............: 100     min=100          max=100

    NETWORK
    data_received........: 1.5 MB  12 kB/s
    data_sent............: 447 kB  3.6 kB/s



running (2m04.8s), 000/100 VUs, 2930 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  2m0s
time="2026-01-16T13:33:32-05:00" level=error msg="thresholds on metrics 'errors, http_req_duration, http_req_failed' have been crossed"